kossnikita/at32f4xx-pac/src/at32f407/at32f407.svd
        <register>
          <name>REMAP7</name>
          <displayName>REMAP7</displayName>
          <description>IO MUX remap register 7
          (IOMUX_REMAP7)</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXT_SPIM_GMUX</name>
              <description>SPIM muxing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXT_SPIM_GEN</name>
              <description>SPIM enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC1_ETP_GMUX</name>
              <description>ADC1 external trigger preempted 
              conversion muxing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC1_ETO_GMUX</name>
              <description>ADC1 external trigger ordinary 
              conversion muxing</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC2_ETP_GMUX</name>
              <description>ADC2 external trigger preempted 
              conversion muxing</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC2_ETO_GMUX</name>
              <description>ADC2 external trigger ordinary 
              conversion muxing</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWJTAG_GMUX</name>
              <description>Serial wire JTAG muxing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PD01_GMUX</name>
              <description>PortD0/PortD1 mappingon 
              OSC_IN/OSC_OUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XMC_GMUX</name>
              <description>XMC muxing</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>XMC_NADV_GMUX</name>
              <description>XMC_NADV muxing</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP8</name>
          <displayName>REMAP8</displayName>
          <description>IO MUX remap register 8
          (IOMUX_REMAP8)</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EMAC_GMUX</name>
              <description>Ethernet MAC muxing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MII_RMII_SEL_GMUX</name>
              <description>MII_RMII select muxing</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTP_PPS_GMUX</name>
              <description>PTP_PPS muxing</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART6_GMUX</name>
              <description>USART6 muxing</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>UART7_GMUX</name>
              <description>UART7 muxing</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>UART8_GMUX</name>
              <description>UART8 muxing</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>EXINT</description>
      <groupName>EXINT</groupName>
      <baseAddress>0x40010400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TAMPER</name>
        <description>Tamper interrupt</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>EXINT0</name>
        <description>EXINT Line0 interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXINT1</name>
        <description>EXINT Line1 interrupt</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>EXINT2</name>
        <description>EXINT Line2 interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>EXINT3</name>
        <description>EXINT Line3 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>EXINT4</name>
        <description>EXINT Line4 interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>EXINT9_5</name>
        <description>EXINT Line[9:5] interrupts</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>EXINT15_10</name>
        <description>EXINT Line[15:10] interrupts</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>PVM</name>
        <description>PVM interrupt connect to EXINT line16</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>RTCALARM</name>
        <description>RTC Alarm interrupt connect to EXINT line17</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>USBFSWakeUp</name>
        <description>USB Device FS Wakeup interrupt connect to EXINT line18</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>EMAC_WKUP</name>
        <description>EMAC_WKUP interrupt connect to EXINT line19</description>
        <value>80</value>
      </interrupt>
      <registers>
        <register>
          <name>INTEN</name>
          <displayName>INTEN</displayName>
          <description>Interrupt enable register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>20</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-19</dimIndex>
              <name>INTEN%s</name>
              <description>Interrupt enable or disable on line %s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>INTEN0R</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt request is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt request is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>INTEN0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Interrupt request disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Interrupt request enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTEN</name>
          <displayName>EVTEN</displayName>
          <description>Event enable register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>20</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-19</dimIndex>
              <name>EVTEN%s</name>
              <description>Event enable or disable on line %s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EVTEN0R</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Event request is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Event request is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>EVTEN0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Event request disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Event request enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POLCFG1</name>
          <displayName>POLCFG1</displayName>
          <description>Rising polarity configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>20</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-19</dimIndex>
              <name>RP%s</name>
              <description>Rising polarity configuration bit on line %s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RP0R</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Rising trigger is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Rising trigger is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>RP0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Rising trigger disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Rising trigger enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POLCFG2</name>
          <displayName>POLCFG2</displayName>
          <description>Falling polarity configuration register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>20</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-19</dimIndex>
              <name>FP%s</name>
              <description>Falling polarity configuration bit on line %s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FP0R</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Falling polarity is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Falling polarity is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>FP0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Falling polarity disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Falling polarity enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRG</name>
          <displayName>SWTRG</displayName>
          <description>Software triggle register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>20</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-19</dimIndex>
              <name>SWT%s</name>
              <description>Software trigger on line %s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <enumeratedValues>
                <name>SWT0R</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoTrigger</name>
                  <description>Default value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Triggered</name>
                  <description>Software trigger generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>SWT0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Generate trigger</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTS</name>
          <displayName>INTSTS</displayName>
          <description>Interrupt status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>20</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-19</dimIndex>
              <name>LINE%s</name>
              <description>Line %s status bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>LINE0R</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoInterrupt</name>
                  <description>No interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <description>Interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>LINE0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear status flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
