kossnikita/at32f4xx-pac/src/at32f407/at32f407.svd
        <register>
          <name>CM2_OUTPUT</name>
          <displayName>CM2_OUTPUT</displayName>
          <description>Channel output mode register 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>3-4</dimIndex>
              <name>C%sOSEN</name>
              <description>Channel %s output switch enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C3OSENR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>CxORAW is not affected by EXT input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Once a high level is detect on EXT input, clear CxORAW</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>C3OSENW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>CxORAW is not affected by EXT input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Once a high level is detect on EXT input, clear CxORAW</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>3-4</dimIndex>
              <name>C%sOCTRL</name>
              <description>Channel %s output control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>COCTRL</name>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnected. CxORAW is disconnected from CxOUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>CxORAW is high when TMRx_CVAL=TMRx_CxDT</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>CxORAW is low when TMRx_CVAL=TMRx_CxDT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Toggle</name>
                  <description>Switch CxORAW level when TMRx_CVAL=TMRx_CxDT</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceLow</name>
                  <description>CxORAW is forced low</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceHigh</name>
                  <description>CxORAW is forced high</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_A</name>
                  <description>PWM mode A</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_B</name>
                  <description>PWM mode B</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>3-4</dimIndex>
              <name>C%sOBEN</name>
              <description>Channel %s output buffer enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C3OBENR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Channel output buffer is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Channel output buffer is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>C3OBENW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Channel output buffer disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Channel output buffer enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>3-4</dimIndex>
              <name>C%sOIEN</name>
              <description>Channel %s output immediately enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C3OIEN</name>
                <enumeratedValue>
                  <name>Compare</name>
                  <description>Need to compare the CVAL with CxDT before generating an output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Immediately</name>
                  <description>No need to compare the CVAL and CxDT. An output is generated immediately when a trigger event occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C4C</name>
              <description>Channel 4 configure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C4C</name>
                <enumeratedValue>
                  <name>Output</name>
                  <description>C4IN channel is configured as output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C4IFP4</name>
                  <description>Input, C4IN is mapped on C4IFP4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C3IFP4</name>
                  <description>Input, C4IN is mapped on C3IFP4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIS</name>
                  <description>Input, C4IN is mapped on STCI. This mode works only when the internal trigger input is selected by STIS.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C3C</name>
              <description>Channel 3 configure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C3C</name>
                <enumeratedValue>
                  <name>Output</name>
                  <description>C3IN channel is configured as output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C3IFP3</name>
                  <description>Input, C3IN is mapped on C3IFP3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C4IFP3</name>
                  <description>Input, C3IN is mapped on C4IFP3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIS</name>
                  <description>Input, C3IN is mapped on STCI. This mode works only when the internal trigger input is selected by STIS.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2_INPUT</name>
          <displayName>CM2_INPUT</displayName>
          <description>Channel input mode register 2</description>
          <alternateRegister>CM2_OUTPUT</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>3-4</dimIndex>
              <name>C%sDF</name>
              <description>Channel %s digital filter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>CDF</name>
                <enumeratedValue>
                  <name>NoFilter</name>
                  <description>No filter, sampling is done at f_DTS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N2</name>
                  <description>f_sampling = f_DTS, N=2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N4</name>
                  <description>f_sampling = f_DTS, N=4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N8</name>
                  <description>f_sampling = f_DTS, N=8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div2N6</name>
                  <description>f_sampling = f_DTS/2, N=6</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div2N8</name>
                  <description>f_sampling = f_DTS/2, N=8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div4N6</name>
                  <description>f_sampling = f_DTS/4, N=6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div4N8</name>
                  <description>f_sampling = f_DTS/4, N=8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8N6</name>
                  <description>f_sampling = f_DTS/8, N=6</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8N8</name>
                  <description>f_sampling = f_DTS/8, N=8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16N5</name>
                  <description>f_sampling = f_DTS/16, N=5</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16N6</name>
                  <description>f_sampling = f_DTS/16, N=6</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16N8</name>
                  <description>f_sampling = f_DTS/16, N=8</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32N5</name>
                  <description>f_sampling = f_DTS/32, N=5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32N6</name>
                  <description>f_sampling = f_DTS/32, N=6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32N8</name>
                  <description>f_sampling = f_DTS/32, N=8</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x8</dimIncrement>
              <dimIndex>3-4</dimIndex>
              <name>C%sIDIV</name>
              <description>Channel %s input divider</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C3IDIV</name>
                <enumeratedValue>
                  <name>Every</name>
                  <description>No divider. An input capture is generated at each active edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div2</name>
                  <description>An input compare is generated every 2 active edges</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div4</name>
                  <description>An input compare is generated every 4 active edges</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Div8</name>
                  <description>An input compare is generated every 8 active edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C4C</name>
              <description>Channel 4 configure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C4C</name>
                <enumeratedValue>
                  <name>Output</name>
                  <description>C4IN channel is configured as output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C4IFP4</name>
                  <description>Input, C4IN is mapped on C4IFP4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C3IFP4</name>
                  <description>Input, C4IN is mapped on C3IFP4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIS</name>
                  <description>Input, C4IN is mapped on STCI. This mode works only when the internal trigger input is selected by STIS.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C3C</name>
              <description>Channel 3 configure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>C3C</name>
                <enumeratedValue>
                  <name>Output</name>
                  <description>C3IN channel is configured as output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C3IFP3</name>
                  <description>Input, C3IN is mapped on C3IFP3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C4IFP3</name>
                  <description>Input, C3IN is mapped on C4IFP3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STIS</name>
                  <description>Input, C3IN is mapped on STCI. This mode works only when the internal trigger input is selected by STIS.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCTRL</name>
          <displayName>CCTRL</displayName>
          <description>Channel control
          register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>C%sP</name>
              <description>Channel %s polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C1P</name>
                <enumeratedValue>
                  <name>High</name>
                  <description>Output active high or Input active rising edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Output active low or Input active falling edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>C%sEN</name>
              <description>Channel %s enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>C1ENR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Channel is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Channel is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>C1ENW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Channel disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Channel enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>3</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>1-3</dimIndex>
              <name>C%sCP</name>
              <description>Channel %s complementary polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="C1P"/>
            </field>
            <field>
              <dim>3</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>1-3</dimIndex>
              <name>C%sCEN</name>
              <description>Channel %s complementary enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="C1ENR">
                <usage>read</usage>
              </enumeratedValues>
              <enumeratedValues derivedFrom="C1ENW">
                <usage>write</usage>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CVAL</name>
          <displayName>CVAL</displayName>
          <description>Counter value</description>
          <addressOffset>0x24</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DIV</name>
          <displayName>DIV</displayName>
          <description>Divider value</description>
          <addressOffset>0x28</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PR</name>
          <displayName>PR</displayName>
          <description>Period value</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>RPR</name>
          <displayName>RPR</displayName>
          <description>Repetition of period value</description>
          <addressOffset>0x30</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1-4</dimIndex>
          <name>C%sDT</name>
          <displayName>C%sDT</displayName>
          <description>Channel data register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
